zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_sg/pic32cx_sg41/atdf/PIC32CX1025SG41080.atdf
          <instance name="SERCOM2">
            <register-group name="SERCOM2" name-in-module="SERCOM" address-space="base" offset="0x41012000"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA09" ioset="3"/>
              <signal group="PAD" index="0" function="C" pad="PA12" ioset="1"/>
              <signal group="PAD" index="1" function="D" pad="PA08" ioset="3"/>
              <signal group="PAD" index="1" function="C" pad="PA13" ioset="1"/>
              <signal group="PAD" index="2" function="D" pad="PA10" ioset="3"/>
              <signal group="PAD" index="2" function="C" pad="PA14" ioset="1"/>
              <signal group="PAD" index="3" function="D" pad="PA11" ioset="3"/>
              <signal group="PAD" index="3" function="C" pad="PA15" ioset="1"/>
            </signals>
            <parameters>
              <param name="CLK_REDUCTION" value="1" caption="Reduce clock options to pin 1 for SPI and USART"/>
              <param name="DLY_COMPENSATION" value="1" caption="Compensates for a fast DLY50 element. Assuming 20ns"/>
              <param name="DMA" value="1" caption="DMA support implemented?"/>
              <param name="DMAC_ID_RX" value="8" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="9" caption="Index of DMA TX trigger"/>
              <param name="FIFO_DEPTH_POWER" value="1" caption="2^FIFO_DEPTH_POWER gives rx FIFO depth."/>
              <param name="GCLK_ID_CORE" value="23"/>
              <param name="GCLK_ID_SLOW" value="3"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="RETENTION_SUPPORT" value="0" caption="Retention supported?"/>
              <param name="SE_CNT" value="1" caption="SE counter included?"/>
              <param name="SPI" value="1" caption="SPI mode implemented?"/>
              <param name="SPI_HW_SS_CTRL" value="1" caption="Master _SS hardware control implemented?"/>
              <param name="SPI_ICSPACE_EXT" value="1" caption="SPI inter character space implemented?"/>
              <param name="SPI_OZMO" value="0" caption="OZMO features implemented?"/>
              <param name="SPI_WAKE_ON_SSL" value="1" caption="_SS low detect implemented?"/>
              <param name="SPI_TX_READY_INT_SRC" value="54" caption="SPI TX READY Interrupt"/>
              <param name="SPI_TX_COMPLETE_INT_SRC" value="55" caption="SPI TX COMPLETE Interrupt"/>
              <param name="SPI_RX_INT_SRC" value="56" caption="SPI RX Interrupt"/>
              <param name="SPI_ERROR_INT_SRC" value="57" caption="SPI ERROR Interrupt"/>
              <param name="TTBIT_EXTENSION" value="1" caption="32-bit extension implemented?"/>
              <param name="I2CM" value="1" caption="I2C Master mode implemented?"/>
              <param name="I2CS" value="1" caption="I2C Slave mode implemented?"/>
              <param name="I2CS_AUTO_ACK" value="1" caption="I2C slave automatic acknowledge implemented?"/>
              <param name="I2CS_GROUP_CMD" value="1" caption="I2C slave group command implemented?"/>
              <param name="I2CS_SDASETUP_CNT_SIZE" value="8" caption="I2CS sda setup count size"/>
              <param name="I2CS_SDASETUP_SIZE" value="4" caption="I2CS sda setup size"/>
              <param name="I2CS_SUDAT" value="1" caption="I2C slave SDA setup implemented?"/>
              <param name="I2C_FASTMP" value="1" caption="I2C fast mode plus implemented?"/>
              <param name="I2C_HSMODE" value="1" caption="USART mode implemented?"/>
              <param name="I2C_SCLSM_MODE" value="1" caption="I2C SCL clock stretch mode implemented?"/>
              <param name="I2C_SMB_TIMEOUTS" value="1" caption="I2C SMBus timeouts implemented?"/>
              <param name="I2C_TENBIT_ADR" value="1" caption="I2C ten bit enabled?"/>
              <param name="I2C_0_INT_SRC" value="54" caption="I2C 0 Interrupt"/>
              <param name="I2C_1_INT_SRC" value="55" caption="I2C 1 Interrupt"/>
              <param name="I2C_2_INT_SRC" value="56" caption="I2C 2 Interrupt"/>
              <param name="I2C_3_INT_SRC" value="57" caption="I2C 3 Interrupt"/>
              <param name="USART" value="1" caption="USART mode implemented?"/>
              <param name="USART_AUTOBAUD" value="1" caption="USART autobaud implemented?"/>
              <param name="USART_COLDET" value="1" caption="USART collision detection implemented?"/>
              <param name="USART_FLOW_CTRL" value="1" caption="USART flow control implemented?"/>
              <param name="USART_FRAC_BAUD" value="1" caption="USART fractional BAUD implemented?"/>
              <param name="USART_IRDA" value="1" caption="USART IrDA implemented?"/>
              <param name="USART_ISO7816" value="1" caption="USART ISO7816 mode implemented?"/>
              <param name="USART_LIN_MASTER" value="1" caption="USART LIN Master mode implemented?"/>
              <param name="USART_RS485" value="1" caption="USART RS485 mode implemented?"/>
              <param name="USART_SAMPA_EXT" value="1" caption="USART sample adjust implemented?"/>
              <param name="USART_SAMPR_EXT" value="1" caption="USART oversampling adjustment implemented?"/>
              <param name="USART_TX_READY_INT_SRC" value="54" caption="USART TX READY Interrupt"/>
              <param name="USART_TX_COMPLETE_INT_SRC" value="55" caption="USART TX COMPLETE Interrupt"/>
              <param name="USART_RX_INT_SRC" value="56" caption="USART RX Interrupt"/>
              <param name="USART_ERROR_INT_SRC" value="57" caption="USART ERROR Interrupt"/>
              <param name="INSTANCE_ID" value="41" caption="Instance index for SERCOM2"/>
            </parameters>
          </instance>
          <instance name="SERCOM3">
            <register-group name="SERCOM3" name-in-module="SERCOM" address-space="base" offset="0x41014000"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA17" ioset="3"/>
              <signal group="PAD" index="0" function="C" pad="PA22" ioset="1"/>
              <signal group="PAD" index="0" function="C" pad="PB20" ioset="2"/>
              <signal group="PAD" index="1" function="D" pad="PA16" ioset="3"/>
              <signal group="PAD" index="1" function="C" pad="PA23" ioset="1"/>
              <signal group="PAD" index="1" function="C" pad="PB21" ioset="2"/>
              <signal group="PAD" index="2" function="D" pad="PA18" ioset="3"/>
              <signal group="PAD" index="2" function="D" pad="PA20" ioset="2"/>
              <signal group="PAD" index="2" function="C" pad="PA24" ioset="1"/>
              <signal group="PAD" index="3" function="D" pad="PA19" ioset="3"/>
              <signal group="PAD" index="3" function="D" pad="PA21" ioset="2"/>
              <signal group="PAD" index="3" function="C" pad="PA25" ioset="1"/>
            </signals>
            <parameters>
              <param name="CLK_REDUCTION" value="1" caption="Reduce clock options to pin 1 for SPI and USART"/>
              <param name="DLY_COMPENSATION" value="1" caption="Compensates for a fast DLY50 element. Assuming 20ns"/>
              <param name="DMA" value="1" caption="DMA support implemented?"/>
              <param name="DMAC_ID_RX" value="10" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="11" caption="Index of DMA TX trigger"/>
              <param name="FIFO_DEPTH_POWER" value="1" caption="2^FIFO_DEPTH_POWER gives rx FIFO depth."/>
              <param name="GCLK_ID_CORE" value="24"/>
              <param name="GCLK_ID_SLOW" value="3"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="RETENTION_SUPPORT" value="0" caption="Retention supported?"/>
              <param name="SE_CNT" value="1" caption="SE counter included?"/>
              <param name="SPI" value="1" caption="SPI mode implemented?"/>
              <param name="SPI_HW_SS_CTRL" value="1" caption="Master _SS hardware control implemented?"/>
              <param name="SPI_ICSPACE_EXT" value="1" caption="SPI inter character space implemented?"/>
              <param name="SPI_OZMO" value="0" caption="OZMO features implemented?"/>
              <param name="SPI_WAKE_ON_SSL" value="1" caption="_SS low detect implemented?"/>
              <param name="SPI_TX_READY_INT_SRC" value="58" caption="SPI TX READY Interrupt"/>
              <param name="SPI_TX_COMPLETE_INT_SRC" value="59" caption="SPI TX COMPLETE Interrupt"/>
              <param name="SPI_RX_INT_SRC" value="60" caption="SPI RX Interrupt"/>
              <param name="SPI_ERROR_INT_SRC" value="61" caption="SPI ERROR Interrupt"/>
              <param name="TTBIT_EXTENSION" value="1" caption="32-bit extension implemented?"/>
              <param name="I2CM" value="1" caption="I2C Master mode implemented?"/>
              <param name="I2CS" value="1" caption="I2C Slave mode implemented?"/>
              <param name="I2CS_AUTO_ACK" value="1" caption="I2C slave automatic acknowledge implemented?"/>
              <param name="I2CS_GROUP_CMD" value="1" caption="I2C slave group command implemented?"/>
              <param name="I2CS_SDASETUP_CNT_SIZE" value="8" caption="I2CS sda setup count size"/>
              <param name="I2CS_SDASETUP_SIZE" value="4" caption="I2CS sda setup size"/>
              <param name="I2CS_SUDAT" value="1" caption="I2C slave SDA setup implemented?"/>
              <param name="I2C_FASTMP" value="1" caption="I2C fast mode plus implemented?"/>
              <param name="I2C_HSMODE" value="1" caption="USART mode implemented?"/>
              <param name="I2C_SCLSM_MODE" value="1" caption="I2C SCL clock stretch mode implemented?"/>
              <param name="I2C_SMB_TIMEOUTS" value="1" caption="I2C SMBus timeouts implemented?"/>
              <param name="I2C_TENBIT_ADR" value="1" caption="I2C ten bit enabled?"/>
              <param name="I2C_0_INT_SRC" value="58" caption="I2C 0 Interrupt"/>
              <param name="I2C_1_INT_SRC" value="59" caption="I2C 1 Interrupt"/>
              <param name="I2C_2_INT_SRC" value="60" caption="I2C 2 Interrupt"/>
              <param name="I2C_3_INT_SRC" value="61" caption="I2C 3 Interrupt"/>
              <param name="USART" value="1" caption="USART mode implemented?"/>
              <param name="USART_AUTOBAUD" value="1" caption="USART autobaud implemented?"/>
              <param name="USART_COLDET" value="1" caption="USART collision detection implemented?"/>
              <param name="USART_FLOW_CTRL" value="1" caption="USART flow control implemented?"/>
              <param name="USART_FRAC_BAUD" value="1" caption="USART fractional BAUD implemented?"/>
              <param name="USART_IRDA" value="1" caption="USART IrDA implemented?"/>
              <param name="USART_ISO7816" value="1" caption="USART ISO7816 mode implemented?"/>
              <param name="USART_LIN_MASTER" value="1" caption="USART LIN Master mode implemented?"/>
              <param name="USART_RS485" value="1" caption="USART RS485 mode implemented?"/>
              <param name="USART_SAMPA_EXT" value="1" caption="USART sample adjust implemented?"/>
              <param name="USART_SAMPR_EXT" value="1" caption="USART oversampling adjustment implemented?"/>
              <param name="USART_TX_READY_INT_SRC" value="58" caption="USART TX READY Interrupt"/>
              <param name="USART_TX_COMPLETE_INT_SRC" value="59" caption="USART TX COMPLETE Interrupt"/>
              <param name="USART_RX_INT_SRC" value="60" caption="USART RX Interrupt"/>
              <param name="USART_ERROR_INT_SRC" value="61" caption="USART ERROR Interrupt"/>
              <param name="INSTANCE_ID" value="42" caption="Instance index for SERCOM3"/>
            </parameters>
          </instance>
          <instance name="SERCOM4">
            <register-group name="SERCOM4" name-in-module="SERCOM" address-space="base" offset="0x43000000"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA13" ioset="3"/>
              <signal group="PAD" index="0" function="D" pad="PB08" ioset="2"/>
              <signal group="PAD" index="0" function="C" pad="PB12" ioset="1"/>
              <signal group="PAD" index="1" function="D" pad="PA12" ioset="3"/>
              <signal group="PAD" index="1" function="D" pad="PB09" ioset="2"/>
              <signal group="PAD" index="1" function="C" pad="PB13" ioset="1"/>
              <signal group="PAD" index="2" function="D" pad="PA14" ioset="3"/>
              <signal group="PAD" index="2" function="D" pad="PB10" ioset="2"/>
              <signal group="PAD" index="2" function="C" pad="PB14" ioset="1"/>
              <signal group="PAD" index="3" function="D" pad="PB11" ioset="2"/>
              <signal group="PAD" index="3" function="D" pad="PA15" ioset="3"/>
              <signal group="PAD" index="3" function="C" pad="PB15" ioset="1"/>
            </signals>
            <parameters>
              <param name="CLK_REDUCTION" value="1" caption="Reduce clock options to pin 1 for SPI and USART"/>
              <param name="DLY_COMPENSATION" value="1" caption="Compensates for a fast DLY50 element. Assuming 20ns"/>
              <param name="DMA" value="1" caption="DMA support implemented?"/>
              <param name="DMAC_ID_RX" value="12" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="13" caption="Index of DMA TX trigger"/>
              <param name="FIFO_DEPTH_POWER" value="1" caption="2^FIFO_DEPTH_POWER gives rx FIFO depth."/>
              <param name="GCLK_ID_CORE" value="34"/>
              <param name="GCLK_ID_SLOW" value="3"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="RETENTION_SUPPORT" value="0" caption="Retention supported?"/>
              <param name="SE_CNT" value="1" caption="SE counter included?"/>
              <param name="SPI" value="1" caption="SPI mode implemented?"/>
              <param name="SPI_HW_SS_CTRL" value="1" caption="Master _SS hardware control implemented?"/>
              <param name="SPI_ICSPACE_EXT" value="1" caption="SPI inter character space implemented?"/>
              <param name="SPI_OZMO" value="0" caption="OZMO features implemented?"/>
              <param name="SPI_WAKE_ON_SSL" value="1" caption="_SS low detect implemented?"/>
              <param name="SPI_TX_READY_INT_SRC" value="62" caption="SPI TX READY Interrupt"/>
              <param name="SPI_TX_COMPLETE_INT_SRC" value="63" caption="SPI TX COMPLETE Interrupt"/>
              <param name="SPI_RX_INT_SRC" value="64" caption="SPI RX Interrupt"/>
              <param name="SPI_ERROR_INT_SRC" value="65" caption="SPI ERROR Interrupt"/>
              <param name="TTBIT_EXTENSION" value="1" caption="32-bit extension implemented?"/>
              <param name="I2CM" value="1" caption="I2C Master mode implemented?"/>
              <param name="I2CS" value="1" caption="I2C Slave mode implemented?"/>
              <param name="I2CS_AUTO_ACK" value="1" caption="I2C slave automatic acknowledge implemented?"/>
              <param name="I2CS_GROUP_CMD" value="1" caption="I2C slave group command implemented?"/>
              <param name="I2CS_SDASETUP_CNT_SIZE" value="8" caption="I2CS sda setup count size"/>
              <param name="I2CS_SDASETUP_SIZE" value="4" caption="I2CS sda setup size"/>
              <param name="I2CS_SUDAT" value="1" caption="I2C slave SDA setup implemented?"/>
              <param name="I2C_FASTMP" value="1" caption="I2C fast mode plus implemented?"/>
              <param name="I2C_HSMODE" value="1" caption="USART mode implemented?"/>
              <param name="I2C_SCLSM_MODE" value="1" caption="I2C SCL clock stretch mode implemented?"/>
              <param name="I2C_SMB_TIMEOUTS" value="1" caption="I2C SMBus timeouts implemented?"/>
              <param name="I2C_TENBIT_ADR" value="1" caption="I2C ten bit enabled?"/>
              <param name="I2C_0_INT_SRC" value="62" caption="I2C 0 Interrupt"/>
              <param name="I2C_1_INT_SRC" value="63" caption="I2C 1 Interrupt"/>
              <param name="I2C_2_INT_SRC" value="64" caption="I2C 2 Interrupt"/>
              <param name="I2C_3_INT_SRC" value="65" caption="I2C 3 Interrupt"/>
              <param name="USART" value="1" caption="USART mode implemented?"/>
              <param name="USART_AUTOBAUD" value="1" caption="USART autobaud implemented?"/>
              <param name="USART_COLDET" value="1" caption="USART collision detection implemented?"/>
              <param name="USART_FLOW_CTRL" value="1" caption="USART flow control implemented?"/>
              <param name="USART_FRAC_BAUD" value="1" caption="USART fractional BAUD implemented?"/>
              <param name="USART_IRDA" value="1" caption="USART IrDA implemented?"/>
              <param name="USART_ISO7816" value="1" caption="USART ISO7816 mode implemented?"/>
              <param name="USART_LIN_MASTER" value="1" caption="USART LIN Master mode implemented?"/>
              <param name="USART_RS485" value="1" caption="USART RS485 mode implemented?"/>
              <param name="USART_SAMPA_EXT" value="1" caption="USART sample adjust implemented?"/>
              <param name="USART_SAMPR_EXT" value="1" caption="USART oversampling adjustment implemented?"/>
              <param name="USART_TX_READY_INT_SRC" value="62" caption="USART TX READY Interrupt"/>
              <param name="USART_TX_COMPLETE_INT_SRC" value="63" caption="USART TX COMPLETE Interrupt"/>
              <param name="USART_RX_INT_SRC" value="64" caption="USART RX Interrupt"/>
              <param name="USART_ERROR_INT_SRC" value="65" caption="USART ERROR Interrupt"/>
              <param name="INSTANCE_ID" value="96" caption="Instance index for SERCOM4"/>
            </parameters>
          </instance>
          <instance name="SERCOM5">
            <register-group name="SERCOM5" name-in-module="SERCOM" address-space="base" offset="0x43000400"/>
