zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_sg/pic32cx_sg41/atdf/PIC32CX1025SG41080.atdf
      <value-group name="CMCC_CFG__CSIZESW">
        <value name="CONF_CSIZE_1KB" caption="The Cache Size is configured to 1KB" value="0"/>
        <value name="CONF_CSIZE_2KB" caption="The Cache Size is configured to 2KB" value="1"/>
        <value name="CONF_CSIZE_4KB" caption="The Cache Size is configured to 4KB" value="2"/>
      </value-group>
      <value-group name="CMCC_MAINT1__WAY">
        <value name="WAY0" caption="Way 0 is selection for index invalidation" value="0"/>
        <value name="WAY1" caption="Way 1 is selection for index invalidation" value="1"/>
        <value name="WAY2" caption="Way 2 is selection for index invalidation" value="2"/>
        <value name="WAY3" caption="Way 3 is selection for index invalidation" value="3"/>
      </value-group>
      <value-group name="CMCC_MCFG__MODE">
        <value name="CYCLE_COUNT" caption="Cycle counter" value="0"/>
        <value name="IHIT_COUNT" caption="Instruction hit counter" value="1"/>
        <value name="DHIT_COUNT" caption="Data hit counter" value="2"/>
      </value-group>
    </module>
    <module name="DAC" id="U2502" version="1.0.0" caption="Digital-to-Analog Converter">
      <register-group name="DAC" caption="Digital-to-Analog Converter">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable DAC Controller" mask="0x2"/>
        </register>
        <register name="CTRLB" offset="0x1" rw="RW" size="1" initval="0x02" caption="Control B">
          <bitfield name="DIFF" caption="Differential mode enable" mask="0x1"/>
          <bitfield name="REFSEL" caption="Reference Selection for DAC0/1" mask="0x6" values="DAC_CTRLB__REFSEL"/>
        </register>
        <register name="EVCTRL" offset="0x2" rw="RW" size="1" initval="0x00" caption="Event Control">
          <bitfield name="STARTEI0" caption="Start Conversion Event Input DAC 0" mask="0x1"/>
          <bitfield name="STARTEI1" caption="Start Conversion Event Input DAC 1" mask="0x2"/>
          <bitfield name="EMPTYEO0" caption="Data Buffer Empty Event Output DAC 0" mask="0x4"/>
          <bitfield name="EMPTYEO1" caption="Data Buffer Empty Event Output DAC 1" mask="0x8"/>
          <bitfield name="INVEI0" caption="Enable Invertion of DAC 0 input event" mask="0x10"/>
          <bitfield name="INVEI1" caption="Enable Invertion of DAC 1 input event" mask="0x20"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="UNDERRUN0" caption="Underrun 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="UNDERRUN1" caption="Underrun 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="EMPTY0" caption="Data Buffer 0 Empty Interrupt Enable" mask="0x4"/>
          <bitfield name="EMPTY1" caption="Data Buffer 1 Empty Interrupt Enable" mask="0x8"/>
        </register>
        <register name="INTENSET" offset="0x5" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="UNDERRUN0" caption="Underrun 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="UNDERRUN1" caption="Underrun 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="EMPTY0" caption="Data Buffer 0 Empty Interrupt Enable" mask="0x4"/>
          <bitfield name="EMPTY1" caption="Data Buffer 1 Empty Interrupt Enable" mask="0x8"/>
        </register>
        <register name="INTFLAG" offset="0x6" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="UNDERRUN0" caption="Result 0 Underrun" mask="0x1"/>
          <bitfield name="UNDERRUN1" caption="Result 1 Underrun" mask="0x2"/>
          <bitfield name="EMPTY0" caption="Data Buffer 0 Empty" mask="0x4"/>
          <bitfield name="EMPTY1" caption="Data Buffer 1 Empty" mask="0x8"/>
        </register>
        <register name="STATUS" offset="0x7" rw="R" size="1" initval="0x00" caption="Status">
          <bitfield name="READY0" caption="DAC 0 Startup Ready" mask="0x1"/>
          <bitfield name="READY1" caption="DAC 1 Startup Ready" mask="0x2"/>
          <bitfield name="EOC0" caption="DAC 0 End of Conversion" mask="0x4"/>
          <bitfield name="EOC1" caption="DAC 1 End of Conversion" mask="0x8"/>
        </register>
        <register name="SYNCBUSY" offset="0x8" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="DAC Enable Status" mask="0x2"/>
          <bitfield name="DATA0" caption="Data DAC 0" mask="0x4"/>
          <bitfield name="DATA1" caption="Data DAC 1" mask="0x8"/>
          <bitfield name="DATABUF0" caption="Data Buffer DAC 0" mask="0x10"/>
          <bitfield name="DATABUF1" caption="Data Buffer DAC 1" mask="0x20"/>
        </register>
        <register name="DACCTRL" offset="0xC" rw="RW" size="2" count="2" initval="0x0000" caption="DAC n Control">
          <bitfield name="LEFTADJ" caption="Left Adjusted Data" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable DAC0" mask="0x2"/>
          <bitfield name="CCTRL" caption="Current Control" mask="0xC" values="DAC_DACCTRL__CCTRL"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="DITHER" caption="Dithering Mode" mask="0x80"/>
        </register>
        <register name="DATA" offset="0x10" rw="W" access="WSYNC" size="2" count="2" initval="0x0000" caption="DAC n Data">
          <bitfield name="DATA" caption="DAC0 Data" mask="0xFFFF"/>
        </register>
        <register name="DATABUF" offset="0x14" rw="W" access="WSYNC" size="2" count="2" initval="0x0000" caption="DAC n Data Buffer">
          <bitfield name="DATABUF" caption="DAC0 Data Buffer" mask="0xFFFF"/>
        </register>
