zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_sg/pic32cx_sg41/atdf/PIC32CX1025SG41080.atdf
        <register name="ITATBCTR0" offset="0xEF8" rw="R" size="4" access-size="4" caption="ITATBCTR0">
          <bitfield name="ATREADY" caption="" mask="0x1"/>
        </register>
        <register name="FIFO1" offset="0xEFC" rw="R" size="4" access-size="4" caption="Integration ITM Data">
          <bitfield name="ITM0" caption="" mask="0xFF"/>
          <bitfield name="ITM1" caption="" mask="0xFF00"/>
          <bitfield name="ITM2" caption="" mask="0xFF0000"/>
          <bitfield name="ETM_bytecount" caption="" mask="0x3000000"/>
          <bitfield name="ETM_ATVALID" caption="" mask="0x4000000"/>
          <bitfield name="ITM_bytecount" caption="" mask="0x18000000"/>
          <bitfield name="ITM_ATVALID" caption="" mask="0x20000000"/>
        </register>
        <register name="ITCTRL" offset="0xF00" rw="RW" size="4" access-size="4" caption="Integration Mode Control">
          <bitfield name="Mode" caption="" mask="0x1"/>
        </register>
        <register name="CLAIMSET" offset="0xFA0" rw="RW" size="4" access-size="4" atomic-op="set:CLAIMSET" caption="Claim tag set">
        </register>
        <register name="CLAIMCLR" offset="0xFA4" rw="RW" size="4" access-size="4" atomic-op="clear:CLAIMCLR" caption="Claim tag clear">
        </register>
        <register name="DEVID" offset="0xFC8" rw="R" size="4" access-size="4" caption="TPIU_DEVID">
          <bitfield name="NrTraceInput" caption="" mask="0x1"/>
          <bitfield name="AsynClkIn" caption="" mask="0x20"/>
          <bitfield name="MinBufSz" caption="" mask="0x1C0"/>
          <bitfield name="PTINVALID" caption="" mask="0x200"/>
          <bitfield name="MANCVALID" caption="" mask="0x400"/>
          <bitfield name="NRZVALID" caption="" mask="0x800"/>
        </register>
        <register name="DEVTYPE" offset="0xFCC" rw="R" size="4" access-size="4" caption="TPIU_DEVTYPE">
          <bitfield name="SubType" caption="" mask="0xF"/>
          <bitfield name="MajorType" caption="" mask="0xF0"/>
        </register>
      </register-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="WLCSP80" caption="WLCSP80">
      <pin position="A10" pad="PA00"/>
      <pin position="B10" pad="PA01"/>
      <pin position="B9" pad="PA02"/>
      <pin position="C10" pad="PA03"/>
      <pin position="C9" pad="PB04"/>
      <pin position="D6" pad="PB05"/>
      <pin position="D10" pad="AVSS"/>
      <pin position="E10" pad="AVDD"/>
      <pin position="D9" pad="PB06"/>
      <pin position="E9" pad="PB07"/>
      <pin position="F10" pad="PB08"/>
      <pin position="F9" pad="PB09"/>
      <pin position="E8" pad="PA04"/>
      <pin position="D8" pad="PA05"/>
      <pin position="D7" pad="PA06"/>
      <pin position="G10" pad="PA07"/>
      <pin position="H10" pad="PC06"/>
      <pin position="G9" pad="PC07"/>
      <pin position="F8" pad="VSS"/>
      <pin position="F7" pad="VDD"/>
      <pin position="H9" pad="PA08"/>
      <pin position="G8" pad="PA09"/>
      <pin position="E7" pad="PA10"/>
      <pin position="E6" pad="PA11"/>
      <pin position="H8" pad="VDD"/>
      <pin position="H7" pad="VSS"/>
      <pin position="G7" pad="PB10"/>
      <pin position="F6" pad="PB11"/>
      <pin position="G6" pad="PB12"/>
      <pin position="H6" pad="PB13"/>
      <pin position="E5" pad="PB14"/>
      <pin position="F5" pad="PB15"/>
      <pin position="H5" pad="PC12"/>
      <pin position="G5" pad="PC13"/>
      <pin position="F4" pad="PC14"/>
      <pin position="G4" pad="PC15"/>
      <pin position="H4" pad="PA12"/>
      <pin position="F3" pad="PA13"/>
      <pin position="H3" pad="PA14"/>
      <pin position="H2" pad="PA15"/>
      <pin position="G3" pad="VSS"/>
      <pin position="G2" pad="VDD"/>
      <pin position="H1" pad="PA16"/>
      <pin position="E4" pad="PA17"/>
      <pin position="E3" pad="PA18"/>
      <pin position="F2" pad="PA19"/>
      <pin position="G1" pad="PC16"/>
      <pin position="F1" pad="PC17"/>
      <pin position="D1" pad="PB16"/>
      <pin position="E1" pad="PB17"/>
      <pin position="E2" pad="PB18"/>
      <pin position="D2" pad="PB19"/>
      <pin position="D3" pad="PB20"/>
      <pin position="C1" pad="PB21"/>
      <pin position="C2" pad="PA20"/>
      <pin position="D4" pad="PA21"/>
      <pin position="B1" pad="PA22"/>
      <pin position="D5" pad="PA23"/>
      <pin position="A2" pad="PA24"/>
      <pin position="A1" pad="PA25"/>
      <pin position="B2" pad="VSS"/>
      <pin position="B3" pad="VDD"/>
      <pin position="A3" pad="PB22"/>
      <pin position="A4" pad="PB23"/>
      <pin position="C3" pad="PC27"/>
      <pin position="B4" pad="PC28"/>
      <pin position="C4" pad="PA27"/>
      <pin position="C5" pad="RESET_N"/>
      <pin position="A5" pad="VDDCORE"/>
      <pin position="B5" pad="VSS"/>
      <pin position="C6" pad="VSW"/>
      <pin position="A6" pad="VDD"/>
      <pin position="B6" pad="PA30"/>
      <pin position="C7" pad="PA31"/>
      <pin position="A7" pad="PB30"/>
      <pin position="B7" pad="PB31"/>
      <pin position="A8" pad="PB00"/>
      <pin position="B8" pad="PB01"/>
      <pin position="A9" pad="PB02"/>
      <pin position="C8" pad="PB03"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
